{
  "Photoshop": [
    {
      "type": "title",
      "text": "Photoshop: Red Eye Fix for Difficult Cases in People and Pets"
    },
    {
      "type": "paragraph",
      "text": "Recent versions of photo editing software have an automatic red eye removal tool. But what do you do when that tool fails as it does all too often with people, and always with pets?",
      "notes": [
        {
          "note": "The Red Eye Removal tool removes the colour red. Pets' eyes become green instead of red, so the tool won't work in this situtation."
        }
      ]
    },
    {
      "type": "paragraph",
      "text": "Here’s one technique that I like to use. I’m going to illustrate it on a pet photo featuring “green eye”, but the same trick works on people with red eye, too."
    },
    {
      "type": "image",
      "url": "http://www.digital-photography-school.com/wp-content/uploads/2011/03/steele-redeye-1.jpg"
    },
    {
      "type": "paragraph",
      "text": "1. Zoom in on the eye of your subject"
    },
    {
      "type": "image",
      "url": "http://www.digital-photography-school.com/wp-content/uploads/2011/03/steele-redeye-2.jpg"
    },
    {
      "type": "paragraph",
      "text": "2. Get your Paintbrush (Keyboard shortcut B)"
    },
    {
      "type": "paragraph",
      "text": "3. Set your foreground color to black"
    },
    {
      "type": "image",
      "url": "http://www.digital-photography-school.com/wp-content/uploads/2011/03/steele-redeye-3.jpg"
    },
    {
      "type": "paragraph",
      "text": "4. In the options bar, set the brush mode to Color, opacity 100%"
    },
    {
      "type": "image",
      "url": "http://www.digital-photography-school.com/wp-content/uploads/2011/03/steele-redeye-4.jpg"
    },
    {
      "type": "paragraph",
      "text": "By painting with the brush in this mode, we will desaturate the area that we paint."
    },
    {
      "type": "paragraph",
      "text": "5. Using a small brush with a medium-soft edge, paint the mis-colored part of the eye to desaturate it."
    },
    {
      "type": "image",
      "url": "http://www.digital-photography-school.com/wp-content/uploads/2011/03/steele-redeye-5.jpg"
    },
    {
      "type": "paragraph",
      "text": "Since all we are doing is desaturating, this leaves the highlight and other gradients that reveal the shape of the eye intact. If we simply painted black we would destroy these details that make the eye look realistic."
    },
    {
      "type": "paragraph",
      "text": "After desaturating, all we need to do is darken the pupil."
    },
    {
      "type": "paragraph",
      "text": "6. Get the Burn tool"
    },
    {
      "type": "image",
      "url": "http://www.digital-photography-school.com/wp-content/uploads/2011/03/steele-redeye-6.jpg"
    },
    {
      "type": "paragraph",
      "text": "7. In the options bar, select Midtones, Exposure 20%"
    },
    {
      "type": "image",
      "url": "http://www.digital-photography-school.com/wp-content/uploads/2011/03/steele-redeye-7.jpg"
    },
    {
      "type": "paragraph",
      "text": "8. Paint gradually in the pupil to burn (darken) the Midtones"
    },
    {
      "type": "image",
      "url": "http://www.digital-photography-school.com/wp-content/uploads/2011/03/steele-redeye-8.jpg"
    },
    {
      "type": "paragraph",
      "text": "By restricting our burn to the Midtones, we avoid destroying the highlight in the eye or darkening that natural rim around the eye. We only affect the middle gray that was originally colored red or green."
    },
    {
      "type": "paragraph",
      "text": "9. Darken the pupil to a reasonably dark gray (not pure black), and you’re done!"
    },
    {
      "type": "image",
      "url": "http://www.digital-photography-school.com/wp-content/uploads/2011/03/steele-redeye-9.jpg"
    },
    {
      "type": "paragraph",
      "text": "Of course, this technique won’t work in every case, because there are a lot of different types of “red eye” in people and animals, but it’s usually my first go-to method for tough cases."
    }
  ],
  "GIMP": [
    {
      "type": "title",
      "text": "How To Remove Red Eyes With GIMP"
    },
    {
      "type": "paragraph",
      "text": "Removing red eyes from photos with Gimp is a straight forward process.  It involves just five steps and allows for a fair amount of flexibility for the photographer.  Let’s jump right in!"
    },
    {
      "type": "image",
      "url": "http://digital-photography-school.com/wp-content/uploads/2009/08/windowslivewriterhowtoremoveredeyeswithgimp-4ebredeye1-thumb.jpg"
    },
    {
      "type": "paragraph",
      "text": "That’s me.  Slightly out of focus as usual.  This shot was taken with a simple point and shoot in near darkness. And with plenty of red to remove.  The trick is to not simply replace the red with another color or the result will be too fake."
    },
    {
      "type": "paragraph",
      "text": "1) Zoom, zoom, zoom way in (hitting the “+” key) until just the eyes fill the screen like so:"
    },
    {
      "type": "image",
      "url": "http://digital-photography-school.com/wp-content/uploads/2009/08/windowslivewriterhowtoremoveredeyeswithgimp-4ebredeye2-6.jpg"
    },
    {
      "type": "paragraph",
      "text": "2) Click on the Ellipse Select Tool in the Toolbox.  Be sure to select “Feather edges” giving them a radius around 15-20."
    },
    {
      "type": "image",
      "url": "http://digital-photography-school.com/wp-content/uploads/2009/08/windowslivewriterhowtoremoveredeyeswithgimp-4ebredeye3-6.jpg"
    },
    {
      "type": "paragraph",
      "text": "3) Now draw an ellipse around one eye that encompasses the redness to be removed.  Hold down “Shift” and draw an ellipse around the other eye.  The corners of the ellipses can be click and dragged to adjust sizes as needed."
    },
    {
      "type": "image",
      "url": "http://digital-photography-school.com/wp-content/uploads/2009/08/windowslivewriterhowtoremoveredeyeswithgimp-4ebredeye4-6.jpg"
    },
    {
      "type": "paragraph",
      "text": "4) From the Menu Bar select “Filters -> Enhance -> Red Eye Removal”.  A dialog box like this will appear."
    },
    {
      "type": "image",
      "url": "http://digital-photography-school.com/wp-content/uploads/2009/08/windowslivewriterhowtoremoveredeyeswithgimp-4ebredeye5-6.jpg"
    },
    {
      "type": "paragraph",
      "text": "5) Select the amount of removal to suit your desires and then click “OK”"
    },
    {
      "type": "image",
      "url": "http://digital-photography-school.com/wp-content/uploads/2009/08/windowslivewriterhowtoremoveredeyeswithgimp-4ebredeye6-thumb-1.jpg"
    },
    {
      "type": "paragraph",
      "text": "Presto!  You’re finished!  The tool works to varying degrees depending on the amount of redness but when a tight selection is made around the eyes, the results are very pleasing while not seeming too fake.  I chose a slightly blurry photo as they are the hardest from which to remove redeye.  A crisper picture will produce better results as there will be more contrast between the red and all other colors."
    },
    {
      "type": "paragraph",
      "text": "While there are many different ways to select the area for redeye removal, I chose the Ellipse over the Fuzzy Select Tool as I found the Fuzzy Select tool to be more cumbersome when the redeyes have multiple shades of red.  Some people also suggest selecting a larger space with the Rectangle Select Tool, however this did not work for me as my skin tone was too close to the redeye color and gave poor results.  Feel free to try another selection method and find what works best for you."
    }
  ]
}